forms/Solicitação de Compras Oncoprod/exemplo_faturamento.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://ws.workflow.ecm.technology.totvs.com/">
   <soapenv:Header />
   <soapenv:Body>
      <ws:startProcessClassic>
         <username>EMAIL_USUARIO</username>
         <password>SENHA</password>
         <companyId>1</companyId>
         <processId>FaturamentoComprasOncoprod</processId>
         <choosedState>0</choosedState>
         <colleagueIds/>
         <comments/>
         <userId>ID_USUARIO</userId>
         <completeTask>true</completeTask>
         <attachments>
            <item>
               <attachmentSequence>1</attachmentSequence>
               <attachments>
                  <attach>true</attach>
                  <fileName>#NOME_ARQUIVO#</fileName>
                  <filecontent>#ARQUIVO_BASE64#</filecontent>
               </attachments>
               <companyId>1</companyId>
               <deleted>false</deleted>
               <description>#DESCRICAO_ANEXO#</description>
               <fileName>#NOME_ARQUIVO#</fileName>
               <newAttach>true</newAttach>
               <originalMovementSequence>0</originalMovementSequence>
               <version>1000</version>
            </item>
         </attachments>
         <cardData>
            <item>
               <key>nomeSolicitante</key>
               <value>NOME_SOLICITANTE</value>
            </item>
            <item>
                <key>idSolicitante</key>
                <value>ID_USUARIO</value>
            </item>
            <item>
                <key>dataSolicitacao</key>
                <value>DATA_ SOLICITACAO</value>
            </item>
            <item>
                <key>codFilial</key>
                <value>CODIGO_FILIAL</value>
            </item>
            <item>
                <key>filial</key>
                <value>FILIAL</value>
            </item>
             <item>
                <key>ufFilial</key>
                <value>UF</value>
            </item>
             <item>
                <key>codFilialFluig</key>
                <value>COD_FILIAL_FLUIG</value>
            </item>
            <item>
                <key>codFornecedor</key>
                <value>COD_FORNECEDOR</value>
            </item>
            <item>
                <key>lojFornecedor</key>
                <value>LOJ_FORNECEDOR</value>
            </item>
            <item>
                <key>fornecedor</key>
                <value>FORNECEDOR</value>
            </item>
            <item>
                <key>codCentroCusto</key>
                <value>COD_CENTRO_CUSTO</value>
            </item>
            <item>
                <key>centroDeCusto</key>
                <value>CENTRO_DE_CUSTO</value>
            </item>
            <item>
                <key>infoAdicionais</key>
                <value>INFOMACOES_ADICIONAIS</value>
            </item>
            <item>
                <key>tabelaPreco</key>
                <value>TABELA_DE_PRECO</value>
            </item>
            <item>
                <key>prazoPagamento</key>
                <value>PRAZO_PAGAMENTO</value>
            </item>
            <item>
                <key>localEntrega</key>
                <value>null</value>
            </item>
            <item>
                <key>prazoEntrega</key>
                <value>PRAZO_ENTREGA</value>
            </item>
              <item>
            <key>itemProd___1</key>
                <value>ITEM</value>
            </item>
            <item>
                <key>numProd___1</key>
                <value>NUMERO_PRODUTO</value>
            </item>
            <item>
                <key>nomeProd___1</key>
                <value>NOME_PRODUTO</value>
            </item>
            <item>
                <key>unidadeProd___1</key>
                <value>UNIDADE_PRODUTO</value>
            </item>
            <item>
                <key>saldoAberto___1</key>
                <value>SALDO_ABERTO</value>
            </item>
            <item>
                <key>inventarioProd___1</key>
                <value>INVENTARIO</value>
            </item>
            <item>
                <key>caixaProd___1</key>
                <value>QTD_CAIXA</value>
            </item>
            <item>
                <key>qtdProd___1</key>
                <value>QTD_UNIDADE</value>
            </item>
            <item>
                <key>valorProd___1</key>
                <value>VALOR_PRODUTO</value>
            </item>
            <item>
                <key>valorTotalProd___1</key>
                <value>VALOR_TOTAL_PRODUTO</value>
            </item>
            <item>
                <key>custoMensalProd___1</key>
                <value>CONSUMO_M_MENSAL</value>
            </item>
            <item>
                <key>fabricanteProd___1</key>
                <value>FABRICANTE</value>
            </item>
            <item>
                <key>contaContabilProd___1</key>
                <value>CONTA_CONTÁBIL</value>
            </item>
            <item>
                <key>valorTotal</key>
                <value>VALOR_SOLICITACAO</value>
            </item>
            <item>
                <key>grupoFilial</key>
                <value>GRUPO_FILIAL</value>
            </item>
         </cardData>
         <appointment />
         <managerMode>0</managerMode>
      </ws:startProcessClassic>
   </soapenv:Body>
</soapenv:Envelope>